ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
         $title = 'Daftar Artikel';
         $q = $this->request->getVar('q') ?? '';
         $model = new ArtikelModel();
         $data = [
           'title' => $title,
           'q' => $q,
           'artikel' => $model->like('judul', $q)->paginate(2), # data dibatasi 2 record per halaman
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 4, 2
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'

    public function add()
    {
        // validasi data.
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();
        if ($isDataValid) {
            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getVar('judul')),
            ]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('Artikel Kelima', 'Lorem ipsum dolor sit amet adipiscing bibendum sem orci tempus aliquet gravida, orci amet iaculis aptent blandit quam accumsan donec in facilisis, cursus ante curabitur aliquet condimentum tincidunt facilisis non cubilia lorem et pretium aliquam phasellus ipsum metus quisque auctor tristique donec nibh, praesent congue ultricies aenean ornare ligula sagittis proin sed vestibulum purus tempus aenean neque aliquam curae vivamus purus egestas ligula tincidunt nullam.', 'Artikel-Kelima')